       IDENTIFICATION DIVISION.
       PROGRAM-ID. HappyBirthday.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "**************************************************".
           CEEDLYM(500);
           DISPLAY "**************************************************".

       PROGRAM-DONE.
           STOP RUN.
